

海饼干

6
原创
3
转载
0
译文
0
评论
549
访问
京 ICP 证 070598 号img

Copyright ? 1999-2016, 
CSDN.NET, All Rights Reserved

2017
四月
22
转
GitHub Windows下客户端的安装及简单使用
分类：github

 （1）  （0） 编辑  删除

首先到官网下载Github客户端，官网地址：https://desktop.github.com/ 
这里写图片描述

点击上图红框的按钮开始下载客户端。

双击下载好的客户端，开始安装。 
这里写图片描述

双击之后出现一个框 
这里写图片描述

之后等待一段时间，出现一个在线下载界面 
这里写图片描述

在线下载完成之后开始进行安装。安装完成之后桌面会多了两个图标，点击左边的图标打开客户端。 
这里写图片描述

输入用户名和密码，点击登录 
这里写图片描述

新建一个仓库 
这里写图片描述

仓库创建完毕之后，找到上面创建仓库时指定的本地路径，比如我的是：D:\用户目录\我的文档\Github\Test 
这里写图片描述

在这个文件夹里面随便新建一个文件，比如test.txt，在里面随便输入几个文字。 
这里写图片描述

这时回到Github客户端，会发现刚才新建的”test”仓库对应的change选项有一个新消息 
这里写图片描述

在客户端的下方填写相关描述，点击”Commit to master”进行提交 
这里写图片描述

点击”Commit to master”只是让Github客户端记录这次进行的改动，相当于一次游戏存档，在将来的某一天如果想重玩这个存档，可以点击上面的圆圈“读取存档”，让项目恢复到这次记录的状态。 
这里写图片描述

如果想将本地的改动提交到网站上，可以点击右上角的”Sync”。 
这里写图片描述

现在到自己的Github主页上看看，可以看到我们新建的”test”项目已经出现在个人主页上了。 
这里写图片描述
之后的每次改动，只要重复第10、11、12个步骤即可。

顶0 踩0

 
 
学习记录--生成对抗网络GAN研究进展（一）
发表评论



发表评论  

  暂无评论

 
img
海饼干不是饼干

等级：

排名：千里之外

 
文章搜索
博客专栏
文章分类
文章存档
阅读排行
评论排行
推荐文章
img
